:PROPERTIES:
:ID:       6E8D2938-697C-4498-9BA4-4212CB0CCF9A
:END:
#+title: JavaScript Date


* [[id:B178F57B-461C-4AF3-A52E-941A3D72571F][JavaScript]]

* Date
- Date is an object
- Represents a moment in TIME 
- new Date() 
- 
- 

  #+begin_src js :results output



    // create variable with new date()

    let now = new Date();
    now;

    // Get the current timstamp

    console.log(now.getTime());


  #+end_src

  #+RESULTS:
  : 1638326784779

* 4 Ways to Create a Date

#+begin_src js :results output

   // new Date()
   date1 = new Date();
   console.log(date1);

   // new Date(timestamp)
   date1 = new Date(0);
   console.log(date1);

   // new Date(date string)
   date1 = new Date('2021-12-02 3:30');
   console.log(date1);

   /* new Date(year, month, day, hours,
  minutes, seconds, millseconds) */
   date1 = new Date(2021,11,02,11,0,0);
   console.log(date1);
#+end_src

#+RESULTS:
: 2021-12-02T19:18:20.266Z
: 1970-01-01T00:00:00.000Z
: 2021-12-02T08:30:00.000Z
: 2021-12-02T16:00:00.000Z

